{
  "basics": {
    "name": "Renay Brown",
    "label": "DevOps & Cloud Engineer specializing in building scalable, resilient cloud infrastructure and automating deployment pipelines. Passionate about optimizing system performance, enhancing security, and streamlining CI/CD workflows to drive efficiency. Experienced in Kubernetes, cloud platforms like Azure and AWS, infrastructure-as-code, and monitoring solutions to ensure high availability and reliability. Committed to enabling seamless development and operational processes through automation and best practices.",
    "image": "/me.webp",
    "email": "renaylb@gmail.com",
    "phone": "2817801899",
    "url": "https://renaybrown.net",
    "summary": [
      {
        "paragraph": "I'm a cloud DevOps and Kubernetes engineer striving to make a mark in the cloud computing world. With experience in startup environments, I've streamlined deployments, optimized cloud infrastructure, and enhanced system reliability. My proactive problem-solving skills ensure scalable architectures, efficient automation, and seamless CI/CD workflows, delivering high-performance and resilient cloud solutions."
      },
      {
        "paragraph": "Fueled by my passion for automation and cloud efficiency, I design custom DevOps tools to optimize workflows, often solving challenges I encounter firsthand. I share my journey and insights on my personal blog, blending my expertise in cloud engineering, Kubernetes, and infrastructure as code with my commitment to continuous improvement."
      },
      {
        "paragraph": "My goal is to simplify and enhance people's lives through digital innovation, cultivating and expanding the INGCapaDev brand, and creating a lasting impact on the web development community."
      }
    ],
    "location": {
      "city": "Houston",
      "region": "Texas"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "renayb",
        "url": "https://github.com/RenayB"
      },
      {
        "network": "LinkedIn",
        "username": "renay-brown",
        "url": "https://www.linkedin.com/in/renay-brown/"
      }
    ]
  },
  "work": [
    {
      "name": "Booz Allen",
      "position": "Lead Devops Engineer",
      "startDate": "2024-09-01",
      "endDate": null,
      "summary": "At Booz Allen, I deployed, managed, and optimized CI/CD pipelines and Kubernetes-based infrastructure to support a zero-trust endpoint security platform. I integrated RabbitMQ to enable real-time streaming of user data and deployed PostgreSQL databases for secure and efficient data storage. I also automated deployments using Helm, Ansible, and GitLab CI, reducing manual effort and improving deployment speed. To enhance data availability, I implemented MinIO for replication, and I used Podman and Docker to develop and secure microservices. Additionally, I troubleshot network configurations using TCP/IP, monitored system performance with Grafana, and maintained highly available K3s clusters to ensure 99.9% uptime.",
      "highlights": [""],
      "isRemote": true
    },
    {
      "name": "Lockheed Martin",
      "position": "Senior Software Engineer",
      "startDate": "2018-06-01",
      "endDate": "2024-08-15",
      "summary": "I designed and implemented CI/CD pipelines and infrastructure for enterprise virtual flight software running on Azure Kubernetes Service (AKS). To ensure high availability, I configured multiple node pools, enabled availability zones, and leveraged auto-scaling for resilience and scalability. I introduced GitOps practices with FluxCD, automating deployments and maintaining consistency across cluster environments. Using Python, Java, and C++, I enhanced business logic within the application to meet evolving requirements. Additionally, I developed GitLab pipeline stages in YAML, implemented code coverage tools like gcov and OpenCodeCoverage, and managed various Azure resources, including Virtual Desktops and pipeline runners. I optimized cloud spending by enforcing Azure policies, reducing yearly infrastructure costs by $20K. I also built Grafana dashboards to monitor pipelines, improving issue detection by 25%, and designed Azure Workbooks to track resource usage, cutting monthly expenses by $10K. Beyond cloud infrastructure, I assisted AI engineers in training image identification models and served as a part-time Scrum Master, facilitating agile ceremonies and improving communication across teams.",
      "highlights": [""],
      "isRemote": false
    }
  ],
  "education": [
    {
      "institution": "Stephen F. Austin State University",
      "area": "Computer Science",
      "startDate": "2013-08-05",
      "endDate": "2018-06-12"
    }
  ],
  "certificates": [
    {
      "name": "AWS Certified Solutions Architect Associate",
      "date": "2023-04-15",
      "organization": "AWS",
      "url": "https://www.credly.com/badges/93b24f83-a59e-4c84-9253-6a0c8a7faa16/linked_in_profile"
    },
    {
      "name": "AWS Certified Developer Associate",
      "date": "2023-05-01",
      "organization": "AWS",
      "url": "https://www.credly.com/badges/597cf7f5-3ffc-4c52-8948-c0280c768747/linked_in_profile"
    },
    {
      "name": "CompTIA Security+",
      "date": "2024-07-02",
      "organization": "AWS",
      "url": "https://www.credly.com/earner/earned/badge/a042baac-70da-4e55-b332-a11f97489e8f"
    },
    {
      "name": "Microsoft Certified: Azure Fundamentals",
      "date": "2022-12-02",
      "organization": "Microsoft",
      "url": "https://www.credly.com/earner/earned/badge/a042baac-70da-4e55-b332-a11f97489e8f"
    }
  ],
  "skills": [
    {
      "name": "Python"
    },
    {
      "name": "Java"
    },
    {
      "name": "JavaScript / TypeScript"
    },
    {
      "name": "Git / GitHub / Jenkins"
    },
    {
      "name": "Node.js / Express.js / NestJS"
    },
    {
      "name": "SQL / SQLite / Postgres / SQL Server "
    },
    {
      "name": "AWS / Azure"
    },
    {
      "name": "Bash / Shell"
    },
    {
      "name": "React / Next.js"
    },
    {
      "name": "ArgoCD / FluxCD"
    },
    {
      "name": "Docker / Podman"
    },
    {
      "name": "Ansible / Terraform "
    }
  ],
  "softskills": [
    {
      "name": "Problem-solving"
    },
    {
      "name": "Communication"
    },
    {
      "name": "Leadership"
    },
    {
      "name": "Teamwork"
    },
    {
      "name": "Critical thinking"
    },
    {
      "name": "Growth mindset"
    },
    {
      "name": "Time management"
    },
    {
      "name": "Innovation"
    }
  ],
  "projects": [
    {
      "name": "Aura Series API",
      "isActive": true,
      "description": "API for Aura Series, a social media platform for sharing and discovering new series, with search and recommendation features.",
      "highlights": [
        "Massive user base",
        "NestJS & Neo4J",
        "Mailing",
        "Authentication"
      ],
      "url": "https://www.auraseries.com/"
    },
    {
      "name": "Personal Blog",
      "isActive": true,
      "description": "My personal blog where I share my experiences and knowledge about web development, productivity and other interesting topics.",
      "highlights": [
        "Multilanguage",
        "SEO optimized",
        "100/100 Lighthouse score",
        "PWA Ready",
        "Astro"
      ],
      "url": "https://blog.ingcapadev.com/",
      "github": "https://github.com/INGCapaDev/my-blog"
    },
    {
      "name": "JB Baseball Game",
      "isActive": true,
      "description": "A baseball game simulator, which allow you to mark all the plays available in a baseball game and save a record of the players' plays.",
      "highlights": [
        "Fullscreen oriented",
        "Sound effects",
        "Complex state management",
        "React",
        "Redux Toolkit"
      ],
      "url": "https://baseball-game-react.vercel.app/",
      "github": "https://github.com/INGCapaDev/baseball-game-react"
    }
  ]
}